lm/0/ReThetat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ReThetat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/caseSettings"

dimensions      [0 0 0 0 0 0 0]; // Dimensionless scalar

internalField   uniform $ReThetatInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField; // Exactly matching Tu = 0.1% correlation
    }

    outlet
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            zeroGradient;
         
    }

    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
