lm/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
	freestreamValue $internalField;
    }

    outlet
    {
        type            freestreamVelocity;
	freestreamValue $internalField;
    }

    airfoil
    {
        type            noSlip;
    }

    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
