lm/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/caseSettings"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $nutInlet;

boundaryField
{
    // nut is a DERIVED field (recomputed by correctNut each iteration),
    // so "calculated" is its canonical type -- matching the kko/kkos cases
    // and OpenFOAM 13's own tutorials.  k and omega below already use
    // fixedValue/zeroGradient, so "freestream" here was the odd one out.
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    airfoil
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
