lm/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/caseSettings"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    // omegaWallFunction is part of the SST near-wall treatment.  The kko/kkos
    // (kkLOmega) cases correctly use zeroGradient instead -- that difference is
    // model-required, not an inconsistency.
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
