lm/system/sampleCp
type surfaces; libs ("libsampling.so"); surfaceFormat raw;
fields (pMean); interpolationScheme cell;
surfaces { airfoil { type patch; patches (airfoil); interpolate false; } }
